import type { Evaluation } from '@/typings/quiz'

export const evaluations: Evaluation[] = [
	{
		score: 44, level: 'D', comment: `为了提高你的计算思维能力，我建议你多做一些初级题目。
通过解决更多的初级题目，你可以挑战自己并提升自己的计算思维能力。
你一定可以取得更高的成绩！祝你在未来的学习中取得更大的进步！`,
	},
	{
		score: 64, level: 'C', comment: `恭喜你！你已经取得了及格的成绩。为了进一步提高你的计算思维能力，我建议你继续努力，并尝试解决更多的题目。除了可以做初级题目外，你也可以逐渐挑战一些中级题目。这样可以巩固基础知识，并进一步提高你的计算思维能力。
你一定可以取得更高的成绩！祝你在未来的学习中取得更大的进步！`,
	},
	{
		score: 75, level: 'B', comment: `恭喜你！你已经取得了良好的成绩。
为了进一步提高你的计算思维能力，我建议你继续保持良好的学习态度，并不断挑战自己。尝试解决更多难度适中的题目，中级题目可以居多，高级可以挑战以下。
你一定可以取得更高的成绩！祝你在未来的学习中取得更大的进步！`,
	},
	{
		score: 84, level: 'A-', comment: `恭喜你！你已经取得了良好的成绩。
为了进一步提高你的计算思维能力，我建议你继续保持良好的学习态度，并积极挑战自己。可以做一点中级题目和解决更多难的高级题目。这将帮助你巩固基础知识，并提高你的问题解决能力。`,
	},
	{
		score: 99, level: 'A+', comment: `恭喜你！你已经取得了出色的成绩。
为了进一步提高你的计算思维能力，我建议你继续保持良好的学习态度，并积极挑战自己。可以做一道中级题目巩固基础，重点可以放在练习更多的高级题目。`,
	},
	{
		score: 100, level: 'A++', comment: `恭喜你！你已经取得了完美的成绩。
为了进一步提高你的计算思维能力，我建议你继续保持良好的学习态度，并积极挑战自己。因为你已经具备了良好的基础，重点可以放在练习更多的高级题目。`,
	},
]
